#module for getting characters for test text image generator

#all hangul characters that actually used
actually_used_hangul = "가각간갇갈갉갊감갑값갓갔강갖갗같갚갛개객갠갵갬갭갯갰갱갸갹갼걀걑걍걔걘걭거걱건걷거걸걺검겁것것겅겆겉겊겋게겐겔겜겝겟겠겡겨격격견"\
						 "겯결겸겹겻겻경곁계곈곌곕곗고곡곤곧골곪곬곯곰곱곳공곶과곽관괄괆괌괍괏광괘괜괠괩괬괭괴괵괸괼굄굅굇굉교굔굘굡굣구국군굳굴굵굶굻굼굽"\
						 "굿궁궂궈궉괏굉교굔굘굡굣구국군굳굴굵굶굻굼굽굿궁궂궈궉권궐궛궝궤궷귀귁귄귈귐귑귓규균귤그극근귿글긁금급긋긍긔기긱긴긷길긺김깁깃깅"\
						 "깆깊까깍깎깐깔깖감깝깟갔강깥깨깩깬깰깸깹깻깼깽꺄꺅꺌꺼꺽꺾껀껄껌껍껏껐껑께껙껜껨껫껭껴껸껼꼇꼈꼍꼐꼬꼭꼰꼲꼴꼼꼽꼿꽁꽂꽃꽈꽉꽐꽜"\
						 "꽝꽤꽥꽹꾀꾄꾈꾐꾑꾕꾜꾸꾹꾼꿀꿇꿈꿉꿋꿍꿎꿔꿜꿨꿩꿰꿱꿴꿸뀀뀁뀄뀌뀐뀔뀜뀝뀨끄꾝꾠꾫꾤꾦꾫꾬꾭꾯꾱끝끼끽낀낄낌낍낏낑나낙낚난낟날"\
						 "낡낢남납낫났낭낮낯낱낳내낵낸낼냄냅냇냈냉냐냑냔냘냠냥너넉넔넌널넒넓넘넙넛넜넝넣네넥넨넬넴넵넷넸넹녀녁년녈념녑녔녕녘녜넨노녹논놀놂"\
						 "놈놉놋농높놓놔놘놜놨뇌뇐뇔뇜뇝뇟뇨뇩뇬뇰뇹뇻뇽누눅눈눋눌눔눕눗눙뉘뉬눼뉘뉜뉠뉨뉩뉴뉵뉼늄늅늉느늑는늘늙늚늠늡늣능늦늪늬늰늴니닉닌"\
						 "닐닒님닙닛닝닢다닥닦단닫달닭닮닯닳담답닷닸당닺닻닿대댁댄댈댐댑댓댔댕댜더덕덖던덛덜덞덟덤덥덧덩덫덮데덱덴델뎀뎁뎃뎃뎅뎌뎐뎔뎠뎡데"\
						 "뎬도독돈돋돌돎돐돔돕돗동돛돝돠돤돨돼됐되된될됨됩됫됴두둑둔둘둠둡둣둥둬뒀뒈뒝뒤뒨뒬뒵뒷뒹듀듄듈듐듕드득든듣들듦듬듭듯등듸디딕딘딛"\
						 "딜딤딥딧딨딩딪따딱단딸땀땁땃닸땅닿때땍땐땔땜땝땟땠땡떠떡떤떨떪떫떰떱떳덨떵떻때떽뗀뗄뗌뗍뗏뗐뗑뗘뗬또똑똔똘똥똬똴뙈뙤뙨뚜뚝뚠뚤뚫"\
						 "뚬둥뛔뛰뛴뛸뜀뜁뜅뜨뜩뜬뜯뜰뜸뜹뜻띄띈띌띔띕띠띤띨띰띱띳띵라락란랄람랍랏랐랑랒랖랗래랙랜랠램랩랫랬랭랴략랸럇량러럭런럴럼럽럿렀렁"\
						 "렇레렉렌렐렘렙렛렝려력련렬렴렵렷렸령례렌롑롓로록론롤롬롭롯롱롸롼뢍뢨뢰뢴뢸룀룁룃룅료룐룔룝룟룡루룩룬룰룸룹룻룽뤄뤘뤠뤼뤽륀륄륌륏"\
						 "륑류륙륜률륨륩륫륭르륵른를름릅릇릉릊릍릎리릭린릴림립릿링마막만많맏말맑맒맘맙맛망맞맡맣매맥맨맬맴맵맷맷맹맺먀먁먈먕머먹먼멀멂멈멉"\
						 "멋멍멎멓메멕멘멜멤멥멧멧멩며멱면멸몃몄명몇몌모목몫몬몰몲몸몹못몽뫄뫈뫘뫼묀묄묍묏묑묘묜묠묩묫무묵묶문묻물묽묾뭄뭅뭇뭉뭍뭏뭐뭔뭘뭡"\
						 "뭣뭬뮈뮌뮐뮤뮨뮬뮴뮷므믄믈믐믓미믹민믿밀밂밈밉밋밋밍및밑바박밖밗반받발밝밞밥밤밥밧방밭배백밴밸뱀뱁뱃뱃뱅뱉뱌뱍뱐뱝버벅번벋벌벎범"\
						 "법벗벙벚베벡벤벧벨벰벱벳벴벵벼벽변별볍볏볐병볕베볜보복복본볼봄봅봇봉봐봔봤봬뵀뵈뵈뵉뵌뵐뵘뵙뵤뵨부북분붇불붉붊붐붑붓붕붙붚붜붤붰"\
						 "붸뷔뷕뷘뷜뷩뷰뷴뷸븀븃븅브븍븐블븜븝븟비빅빈빌빎빔빕빗빙빚빛빠빡빤빨빪빰빱빳빴방빻빼빽뺀뺄뺌뺍뺏뺐뺑뺘뱍뺨뻐뻑뻔뻗뻘뻠뻣뻤뻥뻬뼁"\
						 "뼈뼉뼘뼙뼛뼜뼝뽀복뽄뽈뽐뽑뽕뾔뾰뿅뿌뿍뿐뿔뿜뿟뿡쀼쁑쁘븐쁠쁨쁩삐삑삔삘삠삡삣삥사삭삯산삳살삵삶삼삽삿샀상샅새색샌샐샘샙샛샛생샤샥"\
						 "샨샬샴샵샷샹새섄섈섐생서석섞섟선섣설섦섧섬섭섯섰성섶세섹센셀셈셉셋셌셍셔셕션셜셤셥셧셨셩셰셴셸셍소속솎손솔솖솜솝솟송솥솨솩솬솰솽"\
						 "쇄쇈쇌쇔쇗쇘쇠쇤쇨쇰쇱쇳쇼쇽숀숄숌숍숏숑수숙순숟술숨숩숫숭숯숱숲숴쉈쉐쉑쉔쉘쉠쉥쉬쉭쉰쉴쉼쉽쉿슁슈슉슐슘슛슝스슥슨슬슭슴습슷승시"\
						 "식신싣실싫심십싯싱싶싸싹싻싼쌀쌈쌉쌌쌍쌓쌔쌕쌘쌜쌤쌥쌨쌩썅써썩썬썰썲썸썹섰썽쎄쎈쎌셴쏘쏙쏜쏟쏠쏢쏨쏩쏭쏴쏵쏸쐈쐐쐤쐬쐰쐴쐼쐽쑈쑤"\
						 "숙쑨쑬쑴쑵쑹쒀쓌쒜쒸쒼쓩쓰쓱쓴쓸슮쓿씀습씌씐씔씜씨씩씬씰씸씹씻씽아악안앉않알앍앎앓암압앗았앙앝앞애액앤앨앰앱앳앴앵야약얀얄얇얌얍"\
						 "얏양얕얗얘얜얠얩어억언얹얻얼얽얾엄업없엇었엉엊엌엎에엑엔엘엠엡엣엥여역엮연열엶엷염엽엾엿엿영옅옆옇예옌옐옘엡옛옛오옥온올옭옮옰옳"\
						 "옴옵옷옹옻와왁완왈왐왑왓왓왕왜왝왠왬왯왱외왹왼욀욈욉욋욍요욕욘욜욤욥욧용우욱운울욹욺움웁웃웅워웍원월웜웝웠웡웨웩웬웰웸웹웽위윅윈"\
						 "윌윔윕윗윙유육윤율윰윱윳융윻으윽은을읊음읍읏응읒읓읔읕읖읗의읜읠읨읫이익인일읽읾잃임입잇있잉잊잎자작잔잖잗잘잚잠잡잣잣장잦재잭잰"\
						 "잴잼잽잿쟀쟁쟈쟉쟌쟎쟐쟘쟝쟤쟨쟬저적전절젊점접젓정젖제젝젠젤젬젭젯젱져젼졀졈졉졌졍졔조족존졸졺좀좁좃종좆좇좋좌좍좔좝좟좡좨좼좽죄"\
						 "죈죌죔죕죗죙죠죡죤죵주죽준줄줅줆줌줍줏중줘줬줴쥐쥑쥔쥘쥠쥡쥣쥬쥰쥴쥼즈즉즌즐즘즙즛증지직진짇질짊짐집짓징짖짙짚짜짝잔짢짤짭짬짭짯"\
						 "짰짱째짹잰쨀째짹잰잴잼쨉쨋쨌쟁쟈쟌쟝쩌적전절쩜접쩟젓정쩨젱쪄졌쪼족존쫄쫌좁쫏쫑좇쫘쫙쫠쫴좼쬐쬔쬘쬠쬡쭁쭈쭉준쭐쭘쭙쭝쭤쭸쭹쮜쮸쯔"\
						 "쯤쯧쯩찌찍찐찔찜찝찡찢찧차착찬찮찰참찹찻찼창찾채책챈챌챔챕챗챘챙챠챤챦챨챰챵처척천철첨첩첫첫청체첵첸첼쳄쳅쳇쳉쳐쳔쳣체촁초촉촌촐"\
						 "촘촙촛총촤촨촬촹최쵠쵤쵬쵭쵯쵱쵸춈추축춘출춤춥춧충취췄췌췐취췬췰췸췹췻췽츄츈츌츔츙츠측츤츨츰츱츳층치칙친칟칠칡침칩칫칭카칵칸칼캄"\
						 "캅캇캉캐캑캔캘캠캡캣캤캥캬캭컁커컥컨컫컬컴컵컷컸컹케켁켄켈켐켑켓켕켜켠켤켬켭켯켯켱켸코콕콘콜콤콥콧콩콰콱콴콸쾀쾅쾌쾡쾨쾰쿄쿠쿡쿤"\
						 "쿨쿰쿱쿳쿵쿼퀀퀄퀑퀘퀭퀴퀵퀸퀼큄큅큇큉큐큔큘큠크큭큰클큼큽킁키킥킨킬킴킵킷킹타탁탄탈탉탐탑탓탔탕태택탠탤탬탭탯탰탱탸턍터턱턴털턺"\
						 "텀텁텃텄텅테텍텐텔템텝텟텡텨텬텼톄톈토톡톤톨톰톱톳통톺톼퇀퇘퇴퇸툇툉툐투툭툰툴툼토톡톤톨톰톱톳통톺톼퇀퇘퇴퇸툇툉툐투툭툰툴툼툽툿"\
						 "퉁퉈퉜퉤튀튁튄튈튐튑튕튜튠튤튬튱트특튼튿틀틂틈틉틋틔틘틜틤틥티틱틴틸팀팁팃팅파팍팍판팔팖팜팝팟팠팡팥패팩팬팰팸팹팻팼팽퍄퍅퍼퍽펀"\
						 "펄펌펍펏펐펑페펙펜펠펨펩펭펴편펼폄폅폈평폐폘폡폣포폭폰폴폼폽폿퐁퐈퐝푀푄표푠푤푭푯푸푹푼푿풀풂품풉풋풍풔풩퓌퓐퓔퓜퓟퓨퓬퓰퓸퓻퓽"\
						 "프픈플픔픕픗피픽핀필핌핍핏핑하학한할핥함합핫항해핵핸핼햄햅햇햇행햐향허헉헌헐헒험헙헝헤헥헨헬헴헵헷헹혀혁현혈혐협혓혔형헤혠헬혭호"\
						 "혹혼홀홅홈홉홋홍홑화확환활홧황홰홱홴횃횅회획횐횔횝횟횡효횬횰횹횻후훅훈훌훑훔훗훙휘휜휠휨휭훼훽휀휄휑휘휙휜휠휨휩휫휭휴휵휸휼흄흇"\
						 "흉흐흑흔흖흗흘흙흠흡흣흥흩희흰흴흼흽힁히힉힌힐힘힙힛힝"

#get unicode characters between range1 and range2
def get_unicode_chars(range1, range2) :
	return [chr(a) for a in range(range1, range2)]

#get all actually used hangul characters
def get_actually_used_hangul() : 
	return [*actually_used_hangul]

#get all hangul characters
def get_hangul() :
	return get_unicode_chars(44032, 55215)

#get all upper case alphabet
def get_upper_english_alphabet() :
	return get_unicode_chars(65, 91)

#get all lower case alphabet
def get_lower_english_alphabet() :
	return get_unicode_chars(97, 123)

#get all alphabet
def get_english_alphabet() :
	upper = get_upper_english_alphabet()
	lower = get_lower_english_alphabet()
	upper.extend(lower)
	return upper